//

var c = {};
c.virama = '्',

c.vowelIAST = {
    "a": "अ",
    "ā": "आ",
    "i": "इ",
    "ī": "ई",
    "u": "उ",
    "ū": "ऊ",
    "e": "ए",
    "ai": "ऐ",
    "o": "ओ",
    "au": "औ",
    "ṛ": "ऋ",
    "ṝ": "ॠ",
    "ḷ": "ऌ",
    "ḹ": "ॡ"
};

c.ligaIAST = {
    "a": "",
    "ā": "ा",
    "i": "ि",
    "ī": "ी",
    "u": "ु",
    "ū": "ू",
    "e": "े",
    "ai": "ै",
    "o": "ो",
    "au": "ौ",
    "ṛ": "ृ",
    "ṝ": "ॄ",
    "ḷ": "ॢ",
};

c.consIAST = {
    "k": "क",
    "kh": "ख",
    "g": "ग",
    "gh": "घ",
    "c": "च",
    "ch": "छ",
    "j": "ज",
    "jh": "झ",
    "ṭ": "ट",
    "ṭh": "ठ",
    "ḍ": "ड",
    "ḍh": "ढ",
    "t": "त",
    "th": "थ",
    "d": "द",
    "dh": "ध",
    "n": "न",
    "ṇ": "ण",
    "ṅ": "ङ",
    "p": "प",
    "ph": "फ",
    "b": "ब",
    "bh": "भ",
    "m": "म",
    "y": "य",
    "ñ": "ञ",
    "r": "र",
    "l": "ल",
    "v": "व",
    "ś": "श",
    "ṣ": "ष",
    "s": "स",
    "h": "ह"
};


module.exports = c;

// Harvard-Kioto (based on)

var VowelsHK = {
    "a": "अ",
    "aa": "आ",
    "A": "आ",
    "i": "इ",
    "ii": "ई",
    "I": "ई",
    "u": "उ",
    "uu": "ऊ",
    "U": "ऊ",
    "e": "ए",
    "ai": "ऐ",
    "o": "ओ",
    "au": "औ",
    "R": "ऋ",
    "RR": "ॠ",
    "lR": "ऌ",
    "lRR": "ॡ"
}

var vowelsHK = {
    "a": "|", // '|' is for 'non virama' sign only
    "aa": "ा",
    "A": "ा",
    "i": "ि",
    "ii": "ी",
    "I": "ी",
    "u": "ु",
    "uu": "ू",
    "U": "ू",
    "e": "े",
    "ai": "ै",
    "o": "ो",
    "au": "ौ",
    "R": "ृ",
    "RR": "ॄ",
    "lRR": "ॢ",
}

var consonantsHK = {
    "k": "क",
    "kh": "ख",
    "g": "ग",
    "gh": "घ",
    "G": "ङ",
    "c": "च",
    "ch": "छ",
    "j": "ज",
    "jh": "झ",
    "J": "ञ",
    "T": "ट",
    "Th": "ठ",
    "D": "ड",
    "Dh": "ढ",
    "N": "ण",
    "t": "त",
    "th": "थ",
    "d": "द",
    "dh": "ध",
    "n": "न",
    "p": "प",
    "ph": "फ",
    "b": "ब",
    "bh": "भ",
    "m": "म",
    "y": "य",
    "r": "र",
    "l": "ल",
    "v": "व",
    "z": "श",
    "S": "ष",
    "s": "स",
    "h": "ह",
    "": "",
};
